#Найдите сумму цифр трехзначного числа
number=100
print(number//100+number//10%10+number%10)